/* Деси няма търпение за Великденското парти. То трябва да е перфектно и затова решава да подреди сама масата с лакомствата. 
Тя иска да подреди Великденските яйца по цветове, в определен шаблон. Подносът, с който разполага е във формата на триъгълник. 
Тя ви моли за помощ – да напишете програма за оптимално подреждане на яйцата. Имате следните условия от Деси:
•	В програмата цветовете са заместени с цифри
•	Ще получим от конзолата в колко реда трябва да са подредени яйцата
•	Всеки ред съдържа нечетен брой числа (яйца)
•	Първото и последното число от всеки ред трябва да е "1", а средната колона трябва да е номера на колоната
•	Всички номера на колони трябва да се съдържат в първия принтиран ред

Вход
•	На първият ред получаваме числото n – брой редове с яйца.
Ограничения
•	Числото n е цяло число в интервала [1…9];
Изход
•	Според броя на редовете трябва да отпечатаме изхода както е показано в примерните вход и изход, спазвайки условията

Пример:
1234567654321
 12345654321
  123454321
   1234321
    12321
     121
      1 
*/


function easterEggs(input) {
    let n = Number(input);
    let interval = '';
    let buff = ``;
    for (let rows = n; rows > 0; rows--) {
        for (let i = 1; i <= rows; i++) {
            buff += i;
        }
        for (let j = rows - 1; j > 0; j--) {
            buff += j;
        }
        console.log(buff);
        interval += ' ';
        buff = interval;
    }
}
easterEggs(7);