function moon(input) {
    let speed = Number(input[0]);
    let fuel = Number(input[1]);
    let time = Math.ceil((384400 * 2 / speed)) + 3;
    let fuelSpend = (384400 * 2 / 100) * fuel;
    console.log(time);
    console.log(fuelSpend);
}
moon(["5000", "7"])

/**
 * 
 Задача 1. Разстояние до Луната
Георги е космонавт и следващата му мисия е да отиде до Луната. Ако се движи със скорост от X километра в час,
 той ще стигне до там за N часа. Приемаме, че разстоянието между Луната и Земята е 384 400 км.
  Георги ще прекара 3 часа на Луната, след което ще тръгне обратно към Земята. 
Напишете програма, която пресмята за колко часа Георги ще отиде и ще се върне и колко литра гориво ще са му нужни. 
Вход:
Входът се чете от конзолата и съдържа точно 2 реда:
•	На първия ред - средната скорост на движение - реално число в интервала [1000.00... 30000.00]
•	На втория ред - литри гориво нужни за 100 км - реално число в интервала [1.00…20.00]
Изход:
Да се отпечатат на конзолата два реда:
•	Броят на часовете, за които Георги е отишъл и се е върнал (резултатът да се закръгли до по-голямото цяло число).
•	Количеството литри гориво, което е нужно за пътуването.
Примерен вход и изход:

(["10000","5"])
80
38440

(["5000", "7"])
157
53816

(["15000","4"])
55
30752







 */